Exam_09_02

Уровень 4

Темы: Текстовые файлы.

Файл расширения main.c

Входные данные STDIN

Выходные STDOUT

Написать программу осуществляющую вывод тулуфонного справочника на стандартный поток вывода stdout. Данные о контактах построчно хранятся в текстововм файле, путь до которого задается на стандартном потоке ввода stdin заканчивающийся символом новой строки. При этом формат хранения данных в файле отличается от необходимого формата вывода на станадртный поток вывода, описание этих форматов приведено ниже. В конце ответа не должно быть переноса на следующую строку. Проверить на валидность введенные данные. В случае любой ошибки выводить "n/a".

Формат входных данных(файл)
Формат: "имя_контакта:телефон_формат" - перевод на новую строку.

телефон_формат_1:"8-xxx-xxx-xx-xx", где x - цифра от 0 до 9

Пример: Test:8-950-111-22-33

Формат выходных данных
Формат: "имя_контакта телефон_формат_2\n", где \n - перевод на новую строку для всех контактов кроме последнего, который не должен оканчиваться переносом строки, а между именем контакта и его телефоном находиться ровно один пробельный символ.

телефон_формат_2: "+7(xxx)xxx-xx-xx", где x - цифра от 0 до 9

Пример: Test +7(950)111-22-33

Примеры
```

Входные данные stdin
test.txt

выходные данные - файл
Smith:8-950-111-22-33
Milller:8-900-999-66-55

Результат
Smith +7(950)111-22-33
Miller +7(900)999-66-55

```

Решение

```C

#include <stdio.h>
#include <string.h>
#include <ctype.h>

// Функция для проверки валидности и преобразования телефонного номера
int format_phone(char *input_phone, char *output_phone) {
    // Проверка входного формата "8-xxx-xxx-xx-xx"
    if (strlen(input_phone) != 15 || input_phone[0] != '8' || input_phone[1] != '-' ||
        input_phone[5] != '-' || input_phone[9] != '-' || input_phone[12] != '-') {
        return 0;
    }

    // Проверка на то, что все символы x - цифры
    for (int i = 2; i < 15; i++) {
        if ((i == 5 || i == 9 || i == 12)) {
            continue; // Пропускаем символы '-'
        }
        if (!isdigit(input_phone[i])) {
            return 0; // Если не цифра — формат неправильный
        }
    }

    // Формирование строки в формате "+7(xxx)xxx-xx-xx"
    snprintf(output_phone, 20, "+7(%3.3s)%3.3s-%2.2s-%2.2s",
             &input_phone[2], &input_phone[6], &input_phone[10], &input_phone[13]);
    
    return 1;
}

int main() {
    char filename[256];
    
    // Чтение пути к файлу из стандартного ввода
    if (scanf("%255s", filename) != 1) {
        printf("n/a");
        return 1;
    }

    // Открытие файла
    FILE *file = fopen(filename, "r");
    if (!file) {
        printf("n/a");
        return 1;
    }

    char line[256];
    int first_line = 1;

    // Чтение файла построчно
    while (fgets(line, sizeof(line), file)) {
        // Удаление символа новой строки, если он есть
        line[strcspn(line, "\n")] = 0;

        // Разделение строки на имя и телефон
        char *colon_pos = strchr(line, ':');
        if (!colon_pos) {
            printf("n/a");
            fclose(file);
            return 1;
        }

        *colon_pos = '\0'; // Разделяем имя и телефон
        char *name = line;
        char *phone = colon_pos + 1;

        // Преобразуем номер телефона в нужный формат
        char formatted_phone[20];
        if (!format_phone(phone, formatted_phone)) {
            printf("n/a");
            fclose(file);
            return 1;
        }

        // Вывод результата
        if (!first_line) {
            printf("\n");
        }
        printf("%s %s", name, formatted_phone);
        first_line = 0;
    }

    fclose(file);
    return 0;
}


```
