Exam_09_05
Ур 5
Темы Текстовые файлы
файл расширения main.c
Входные данные STDIN
Выходные данные STDOUT

Написать программу осуществляющую вычисление арифметичесих выражений которые содержатся в тектовом файле путь до которых задается относительно на стандартном потоке ввода stdin. Строка с арифметическими выражением состоит из цеоых неотрицательных чисел разделенных арифметическими операциями между двумя числами находиться только одна операция концом арифметического выражения является перевод строки или конец файла. в качестве арифметических операций в выражениях используются сложение и вычитание. Результат вычисления арифметических выражений необходимо вывести на стандартный поток вывожа stdout через запятую с пробелами. если строка выражения не удовлетворяет выше описанным критериям то в качестве результата данного выражения вывести n/a
примеры:

```
входные данные  входные данные - файл  результат
test_1.txt      100+100                200

test_3.txt      100+100-100            100

test_2.txt      100++100               n/a

test_4.txt      1+1                    2,4
                2+2

test_5.txt      1+1                    2, n/a, 4
                100--100

                2+2
```

Решение
```C

#include <stdio.h>
#include <stdlib.h>
#include <ctype.h>
#include <string.h>

// Функция для вычисления выражения с поддержкой нескольких операций
int calculate_expression(char *expression, int *result) {
    int current_number = 0;
    int total = 0;
    char operator = '+'; // Начальное значение — положительное число
    int index = 0;

    // Пропускаем пробелы
    while (isspace(expression[index])) index++;

    // Читаем и обрабатываем выражение
    while (expression[index] != '\0' && expression[index] != '\n') {
        if (isdigit(expression[index])) {
            // Если это число, то считываем его
            current_number = 0;
            while (isdigit(expression[index])) {
                current_number = current_number * 10 + (expression[index] - '0');
                index++;
            }

            // Выполняем операцию на основе текущего оператора
            if (operator == '+') {
                total += current_number;
            } else if (operator == '-') {
                total -= current_number;
            }
        } else if (expression[index] == '+' || expression[index] == '-') {
            // Если это оператор, то запоминаем его
            operator = expression[index];
            index++;
        } else if (isspace(expression[index])) {
            // Пропускаем пробелы
            index++;
        } else {
            // Если встретили что-то другое, кроме числа или оператора, выражение некорректно
            return 0;
        }
    }

    *result = total;
    return 1;
}

int main() {
    char filename[256];
    // Чтение пути к файлу из стандартного ввода
    if (scanf("%255s", filename) != 1) {
        printf("n/a\n");
        return 1;
    }

    // Открытие файла для чтения
    FILE *file = fopen(filename, "r");
    if (!file) {
        printf("n/a\n");
        return 1;
    }

    char line[256];
    int first = 1;  // Для вывода запятой перед результатами
    while (fgets(line, sizeof(line), file)) {
        int result;
        if (calculate_expression(line, &result)) {
            if (!first) {
                printf(", ");
            }
            printf("%d", result);
        } else {
            if (!first) {
                printf(", ");
            }
            printf("n/a");
        }
        first = 0;
    }

    fclose(file);
    return 0;
}



```
